; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	satellite1 - satellite
	instrument1 - instrument
	instrument2 - instrument
	satellite2 - satellite
	instrument3 - instrument
	infrared3 - mode
	image0 - mode
	thermograph1 - mode
	spectrograph2 - mode
	Star0 - direction
	GroundStation2 - direction
	Star3 - direction
	GroundStation5 - direction
	GroundStation6 - direction
	GroundStation7 - direction
	GroundStation8 - direction
	GroundStation9 - direction
	GroundStation11 - direction
	GroundStation12 - direction
	GroundStation14 - direction
	GroundStation15 - direction
	Star17 - direction
	Star18 - direction
	GroundStation22 - direction
	Star23 - direction
	GroundStation19 - direction
	Star24 - direction
	Star21 - direction
	Star4 - direction
	Star1 - direction
	Star13 - direction
	Star10 - direction
	Star20 - direction
	Star16 - direction
	Planet25 - direction
	Planet26 - direction
	Phenomenon27 - direction
	Planet28 - direction
	Phenomenon29 - direction
	Planet30 - direction
	Planet31 - direction
	Star32 - direction
	Planet33 - direction
	Planet34 - direction
	Phenomenon35 - direction
	Phenomenon36 - direction
	Planet37 - direction
	Star38 - direction
	Planet39 - direction
)
(:init
	(supports instrument0 spectrograph2)
	(supports instrument0 image0)
	(calibration_target instrument0 Star4)
	(calibration_target instrument0 Star21)
	(calibration_target instrument0 Star24)
	(calibration_target instrument0 Star16)
	(calibration_target instrument0 Star13)
	(calibration_target instrument0 GroundStation19)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Planet37)
	(supports instrument1 thermograph1)
	(supports instrument1 infrared3)
	(calibration_target instrument1 Star13)
	(calibration_target instrument1 Star1)
	(supports instrument2 image0)
	(supports instrument2 infrared3)
	(calibration_target instrument2 Star10)
	(on_board instrument1 satellite1)
	(on_board instrument2 satellite1)
	(power_avail satellite1)
	(pointing satellite1 GroundStation9)
	(supports instrument3 thermograph1)
	(calibration_target instrument3 Star16)
	(calibration_target instrument3 Star20)
	(on_board instrument3 satellite2)
	(power_avail satellite2)
	(pointing satellite2 GroundStation2)
)
(:goal (and
	(pointing satellite2 Star38)
	(have_image Planet25 spectrograph2)
	(have_image Planet26 spectrograph2)
	(have_image Phenomenon27 image0)
	(have_image Planet28 infrared3)
	(have_image Phenomenon29 spectrograph2)
	(have_image Planet30 spectrograph2)
	(have_image Planet31 thermograph1)
	(have_image Star32 thermograph1)
	(have_image Planet33 infrared3)
	(have_image Planet34 image0)
	(have_image Phenomenon35 infrared3)
	(have_image Phenomenon36 image0)
	(have_image Planet37 infrared3)
	(have_image Star38 thermograph1)
	(have_image Planet39 thermograph1)
))

)

; plan
1. (switch_on instrument3 satellite2)
   deleted: (power_avail satellite2)
   added: (power_on instrument3)
   goals met: 0 of 16
2. (switch_on instrument2 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument2)
   goals met: 0 of 16
3. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 0 of 16
4. (turn_to satellite2 planet31 groundstation2)
   deleted: (pointing satellite2 groundstation2)
   added: (pointing satellite2 planet31)
   goals met: 0 of 16
5. (turn_to satellite1 phenomenon35 groundstation9)
   deleted: (pointing satellite1 groundstation9)
   added: (pointing satellite1 phenomenon35)
   goals met: 0 of 16
6. (turn_to satellite0 phenomenon27 planet37)
   deleted: (pointing satellite0 planet37)
   added: (pointing satellite0 phenomenon27)
   goals met: 0 of 16
7. (turn_to satellite2 star20 planet31)
   deleted: (pointing satellite2 planet31)
   added: (pointing satellite2 star20)
   goals met: 0 of 16
8. (calibrate satellite2 instrument3 star20)
   added: (calibrated instrument3)
   goals met: 0 of 16
9. (turn_to satellite2 planet31 star20)
   deleted: (pointing satellite2 star20)
   added: (pointing satellite2 planet31)
   goals met: 0 of 16
10. (take_image satellite2 planet31 instrument3 thermograph1)
   added: (have_image planet31 thermograph1)
   goals met: 1 of 16
11. (turn_to satellite2 planet39 planet31)
   deleted: (pointing satellite2 planet31)
   added: (pointing satellite2 planet39)
   goals met: 1 of 16
12. (take_image satellite2 planet39 instrument3 thermograph1)
   added: (have_image planet39 thermograph1)
   goals met: 2 of 16
13. (turn_to satellite2 star32 planet39)
   deleted: (pointing satellite2 planet39)
   added: (pointing satellite2 star32)
   goals met: 2 of 16
14. (take_image satellite2 star32 instrument3 thermograph1)
   added: (have_image star32 thermograph1)
   goals met: 3 of 16
15. (turn_to satellite2 star38 star32)
   deleted: (pointing satellite2 star32)
   added: (pointing satellite2 star38)
   goals met: 4 of 16
16. (take_image satellite2 star38 instrument3 thermograph1)
   added: (have_image star38 thermograph1)
   goals met: 5 of 16
17. (turn_to satellite0 star4 phenomenon27)
   deleted: (pointing satellite0 phenomenon27)
   added: (pointing satellite0 star4)
   goals met: 5 of 16
18. (calibrate satellite0 instrument0 star4)
   added: (calibrated instrument0)
   goals met: 5 of 16
19. (turn_to satellite0 phenomenon27 star4)
   deleted: (pointing satellite0 star4)
   added: (pointing satellite0 phenomenon27)
   goals met: 5 of 16
20. (take_image satellite0 phenomenon27 instrument0 image0)
   added: (have_image phenomenon27 image0)
   goals met: 6 of 16
21. (turn_to satellite0 phenomenon29 phenomenon27)
   deleted: (pointing satellite0 phenomenon27)
   added: (pointing satellite0 phenomenon29)
   goals met: 6 of 16
22. (take_image satellite0 phenomenon29 instrument0 spectrograph2)
   added: (have_image phenomenon29 spectrograph2)
   goals met: 7 of 16
23. (turn_to satellite0 phenomenon36 phenomenon29)
   deleted: (pointing satellite0 phenomenon29)
   added: (pointing satellite0 phenomenon36)
   goals met: 7 of 16
24. (take_image satellite0 phenomenon36 instrument0 image0)
   added: (have_image phenomenon36 image0)
   goals met: 8 of 16
25. (turn_to satellite0 planet25 phenomenon36)
   deleted: (pointing satellite0 phenomenon36)
   added: (pointing satellite0 planet25)
   goals met: 8 of 16
26. (take_image satellite0 planet25 instrument0 spectrograph2)
   added: (have_image planet25 spectrograph2)
   goals met: 9 of 16
27. (turn_to satellite0 planet26 planet25)
   deleted: (pointing satellite0 planet25)
   added: (pointing satellite0 planet26)
   goals met: 9 of 16
28. (take_image satellite0 planet26 instrument0 spectrograph2)
   added: (have_image planet26 spectrograph2)
   goals met: 10 of 16
29. (turn_to satellite0 planet30 planet26)
   deleted: (pointing satellite0 planet26)
   added: (pointing satellite0 planet30)
   goals met: 10 of 16
30. (take_image satellite0 planet30 instrument0 spectrograph2)
   added: (have_image planet30 spectrograph2)
   goals met: 11 of 16
31. (turn_to satellite0 planet34 planet30)
   deleted: (pointing satellite0 planet30)
   added: (pointing satellite0 planet34)
   goals met: 11 of 16
32. (take_image satellite0 planet34 instrument0 image0)
   added: (have_image planet34 image0)
   goals met: 12 of 16
33. (turn_to satellite1 star10 phenomenon35)
   deleted: (pointing satellite1 phenomenon35)
   added: (pointing satellite1 star10)
   goals met: 12 of 16
34. (calibrate satellite1 instrument2 star10)
   added: (calibrated instrument2)
   goals met: 12 of 16
35. (turn_to satellite1 phenomenon35 star10)
   deleted: (pointing satellite1 star10)
   added: (pointing satellite1 phenomenon35)
   goals met: 12 of 16
36. (take_image satellite1 phenomenon35 instrument2 infrared3)
   added: (have_image phenomenon35 infrared3)
   goals met: 13 of 16
37. (turn_to satellite1 planet28 phenomenon35)
   deleted: (pointing satellite1 phenomenon35)
   added: (pointing satellite1 planet28)
   goals met: 13 of 16
38. (take_image satellite1 planet28 instrument2 infrared3)
   added: (have_image planet28 infrared3)
   goals met: 14 of 16
39. (turn_to satellite1 planet33 planet28)
   deleted: (pointing satellite1 planet28)
   added: (pointing satellite1 planet33)
   goals met: 14 of 16
40. (take_image satellite1 planet33 instrument2 infrared3)
   added: (have_image planet33 infrared3)
   goals met: 15 of 16
41. (turn_to satellite1 planet37 planet33)
   deleted: (pointing satellite1 planet33)
   added: (pointing satellite1 planet37)
   goals met: 15 of 16
42. (take_image satellite1 planet37 instrument2 infrared3)
   added: (have_image planet37 infrared3)
   goals met: 16 of 16
